# Homework 1

Description: https://github.com/DataTalksClub/data-engineering-zoomcamp/blob/main/cohorts/2023/week_1_docker_sql/homework.md 

## Question 1. Knowing docker tags

Run the command to get information on Docker 

```docker --help```

Now run the command to get help on the "docker build" command

Which tag has the following text? - *Write the image ID to the file* 

- `--imageid string`
- `--iidfile string`
- `--idimage string`
- `--idfile string`


### Answer

In [2]:
!docker build --help | grep "Write the image ID to the file" | awk '{print $1}'

--iidfile

## Question 2. Understanding docker first run

Run docker with the python:3.9 image in an interactive mode and the entrypoint of bash. Now check the python modules that are installed ( use pip list). How many python packages/modules are installed?

## Prepare database

Instead of Postgres here I am using [duckdb](https://duckdb.org) which allows me to directly query on the CSV files.

We'll use the green taxi trips from January 2019:

In [7]:
!wget -O green_tripdata_2019-01.csv.gz https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz

--2023-01-22 19:44:46--  https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz
Resolving github.com (github.com)... 140.82.121.4
Connecting to github.com (github.com)|140.82.121.4|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/d3904232-1a2b-431b-803d-0ee802cd14fc?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230122%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20230122T174334Z&X-Amz-Expires=300&X-Amz-Signature=b94ffac4664da23177e633f1f73b5c1e49c2ac0cad4ff6019035093f6cab7245&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=513814948&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-01.csv.gz&response-content-type=application%2Foctet-stream [following]
--2023-01-22 19:44:46--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/d3904232-1a2b-431b-803d-0ee802cd14fc?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230122%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20230122T174334Z&X-Amz-Expires=300&X-Amz-Signature=b94ffac4664da23177e633f1f73b5c1e49c2ac0cad4ff6019035093f6cab7245&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=513814948&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-01.csv.gz&response-content-type=application%2Foctet-stream
Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 11099245 (11M) [application/octet-stream]
Saving to: ‘green_tripdata_2019-01.csv.gz’

green_tripdata_2019 100%[===================>]  10.58M  5.17MB/s    in 2.0s

2023-01-22 19:44:48 (5.17 MB/s) - ‘green_tripdata_2019-01.csv.gz’ saved [11099245/11099245]

We also download the taxi zone information:

In [29]:
!wget -O taxi_zone_lookup.csv https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv

--2023-01-22 20:00:25--  https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.203.192, 54.231.162.8, 52.217.206.240, ...
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.203.192|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 12322 (12K) [application/octet-stream]
Saving to: ‘taxi_zone_lookup.csv’

taxi_zone_lookup.cs 100%[===================>]  12.03K  --.-KB/s    in 0.001s

2023-01-22 20:00:26 (13.7 MB/s) - ‘taxi_zone_lookup.csv’ saved [12322/12322]

Now I "ingest" these CSV files on a temporaray Duckdb database, and test it:

In [39]:
import duckdb
con = duckdb.connect()

con.execute(
"""
create table green_tripdata as select * from "green_tripdata_2019-01.csv.gz"
"""
)
con.execute(
"""
create table taxi_zone as select * from "taxi_zone_lookup.csv"
"""
)
con.query ("select * from green_tripdata using sample 10").df()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,1,2019-01-27 15:06:27,2019-01-27 15:25:23,N,1,65,225,1,2.50,13.50,0.0,0.5,0.00,0.00,NaN,0.3,14.30,2,1,NaN
1,2,2019-01-19 13:43:21,2019-01-19 14:02:01,N,1,116,220,1,6.01,20.50,0.0,0.5,1.80,2.64,NaN,0.3,25.74,1,1,NaN
2,2,2019-01-28 04:32:40,2019-01-28 05:04:00,N,5,70,186,1,8.26,27.64,0.0,0.5,0.00,5.76,NaN,0.0,33.90,1,2,0
3,2,2019-01-01 08:51:00,2019-01-01 09:05:07,N,5,227,97,1,6.59,24.40,0.0,0.5,0.00,0.00,NaN,0.0,24.90,1,2,NaN
4,1,2019-01-10 07:29:08,2019-01-10 08:06:46,N,1,14,90,1,8.70,30.50,0.0,0.5,0.00,5.76,NaN,0.3,37.06,1,1,NaN
5,2,2019-01-28 10:22:26,2019-01-28 10:43:42,N,1,166,237,1,3.34,15.50,0.0,0.5,1.00,0.00,NaN,0.3,17.30,1,1,0
6,2,2019-01-31 12:35:35,2019-01-31 12:44:07,N,1,74,236,1,1.58,8.00,0.0,0.5,0.88,0.00,NaN,0.3,9.68,1,1,0
7,2,2019-01-17 16:56:24,2019-01-17 17:07:23,N,1,43,143,1,2.42,10.00,1.0,0.5,3.50,0.00,NaN,0.3,15.30,1,1,NaN
8,2,2019-01-07 10:48:13,2019-01-07 11:09:26,N,1,85,40,1,4.75,19.00,0.0,0.5,0.00,0.00,NaN,0.3,19.80,1,1,NaN
9,2,2019-01-09 16:09:52,2019-01-09 16:14:48,N,1,43,238,1,1.03,6.00,1.0,0.5,2.00,0.00,NaN,0.3,9.80,1,1,NaN

In [40]:
con.query ("select * from taxi_zone using sample 10").df()

   LocationID        Borough                           Zone service_zone
0          33       Brooklyn               Brooklyn Heights    Boro Zone
1          40       Brooklyn                Carroll Gardens    Boro Zone
2          41      Manhattan                 Central Harlem    Boro Zone
3         238      Manhattan          Upper West Side North  Yellow Zone
4         120      Manhattan                Highbridge Park    Boro Zone
5         115  Staten Island            Grymes Hill/Clifton    Boro Zone
6         229      Manhattan  Sutton Place/Turtle Bay North  Yellow Zone
7          98         Queens                  Fresh Meadows    Boro Zone
8         138         Queens              LaGuardia Airport     Airports
9          12      Manhattan                   Battery Park  Yellow Zone

So now I am ready to answer the rest of questions!

## Question 3. Count records

How many taxi trips were totally made on January 15?

In [41]:
con.query("""
select count(*) as count
from green_tripdata
where 
    lpep_pickup_datetime between '2019-01-15 00:00:00' and '2019-01-15 23:59:59'
    and lpep_dropoff_datetime between '2019-01-15 00:00:00' and '2019-01-15 23:59:59'
""").df()

   count
0  20530

## Question 4. Largest trip for each day

Which was the day with the largest trip distance Use the pick up time for your calculations.

In [42]:
con.query("""
select lpep_pickup_datetime::date as day_with_largest_trip
from green_tripdata order by trip_distance desc limit 1
""").df()

  day_with_largest_trip
0            2019-01-15

## Question 5. The number of passengers

In 2019-01-01 how many trips had 2 and 3 passengers?

In [45]:
con.query("""
select 
    passenger_count, 
    count(*) as cnt
from 
    green_tripdata
where 
    lpep_pickup_datetime::date = '2019-01-01'
    and passenger_count between 2 and 3
group by passenger_count
order by passenger_count
""").df()

   passenger_count   cnt
0                2  1282
1                3   254

## Question 6. Largest tip

For the passengers picked up in the Astoria Zone which was the drop off zone that had the largest tip? We want the name of the zone, not the id.

In [44]:
con.query("""
select
    do_zone.Zone
from 
    green_tripdata
    join taxi_zone pu_zone on PULocationID = pu_zone.LocationID
    join taxi_zone do_zone on DOLocationID = do_zone.LocationID
where
    pu_zone.Zone='Astoria'
order by tip_amount desc
limit 1
""").df()

                            Zone
0  Long Island City/Queens Plaza